---
kind: property
id: P:Autodesk.Revit.DB.OverrideGraphicSettings.IsCutBackgroundPatternVisible
source: html/48fc6a1c-9d62-5d06-0206-6d790c77a6fb.htm
---
# Autodesk.Revit.DB.OverrideGraphicSettings.IsCutBackgroundPatternVisible Property

The visibility of the cut face background fill pattern.

## Syntax (C#)
```csharp
public bool IsCutBackgroundPatternVisible { get; }
```